---
kind: property
id: P:Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldScaleX
source: html/a098bb5f-6806-09bb-b953-20414d813c2b.htm
---
# Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldScaleX Property

The property labeled "Size X" from the "UnifiedBitmap" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".